src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.maxtest.com/springsoap">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getPersonRequest>
            <gs:name>Max</gs:name>
        </gs:getPersonRequest>
    </soapenv:Body>
</soapenv:Envelope>